# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков
#
#     Напишите программу, которая вычисляет стоимость введенного пользователем слова.
#     Будем считать, что на вход подается только одно слово, которое содержит либо
#     только английские, либо только русские буквы.
#
#     ноутбук
#     12


en_dict = {1:("A","E","I","O","L", "N", "S", "T", "R"),
           2:("D","G"),
           3:("B","C", "M", "P"),
           4:"F",
           5:"K",
           8:("J", "X"),
           10:("Q", "Z")}

ru_dict = {1:("А", "В", "Е", "И", "Н", "О", "Р", "С", "Т"),
           2:("Д", "К", "Л", "М", "П", "У"),
           3:("Б", "Г", "Ё", "Ь", "Я"),
           4:("Й", "Ы"),
           5:("Ж", "З", "Х", "Ц", "Ч"),
           8:("Ш", "Э", "Ю"),
           10:("Ф", "Щ", "Ъ")}
point = [1,2,3,4,5,8,10]
sums = 0
i = 0
j = 0
prov = True


language = int(input("Выберите язык \n 1)RU \n 2)EN:"))
strings = input("Введите слово -> ")
strings = strings.upper()

while i < len(strings):
    j = 0
    if language == 1:
        for key, value in ru_dict.items():
            for item in ru_dict.get(point[j]):
                if strings[i] == item:
                    sums += key
                    break
            j += 1

    elif language == 2:
        for key, value in en_dict.items():
            for item in en_dict.get(point[j]):
                if strings[i] == item:
                    sums += key
                    break
            j += 1
    i += 1
print(f"Ваши очки = {sums}")
